
# 튜플 (순서O, 중복O, 수정X, 삭제X)
#읽기전용 리스트라 생각하면 됨 (리스트보다 속도가 빠름)

#선언
a =()
b = (0,) #원소가 하나인 경우에는 반드시 콤마를 넣어주어야 함
c = (0,1,2,3)
d = (0,1,'car','apple','apart')
e = (0,1,('car','apple','apart'))

#인덱싱
print("#=====================================================================#")
print('d -', type(d), d)
print('d -', d[1])
print('c -', c[0] + c[1] +c[2])
print('e -', e[-1][1])
print('e -', e[2][1])

#슬라이싱
print("#=====================================================================#")
print('d -', d[0:3])
print('d -', d[2:])

#연산
print("#=====================================================================#")
print('c + d', c+d)
print('c * 3', c*3)
print('hi + c[0]','hi' + str(c[0]))
